package com.example.tsumobilkabeta.Ant

object LandmarksDatabase {

    val locations: List<Places> = listOf(
        Places(x = 9455947.53746486, y = 7651657.90278335, id = 1, name = "Университетский родник"),
        Places(
            x = 9455887.94111733,
            y = 7651702.63834499,
            id = 2,
            name = "Староводозаборный родник"
        ),
        Places(x = 9455915.97744535, y = 7651786.13451312, id = 3, name = "Родник Крылова"),
        Places(
            x = 9456268.84450817,
            y = 7651874.99282048,
            id = 4,
            name = "П.Н. Крылов и Л.П. Сергиевская"
        ),
        Places(x = 9455932.90648494, y = 7651888.05345962, id = 5, name = "Сергиевский родник"),
        Places(x = 9455908.54705241, y = 7651909.19560862, id = 6, name = "Родник Леман"),
        Places(x = 9455909.67693175, y = 7651983.71019352, id = 7, name = "Ботанический родник"),
        Places(x = 9455897.63126897, y = 7651993.38119464, id = 8, name = "Флоренский родник"),
        Places(x = 9456181.21183263, y = 7651875.26092744, id = 9, name = "Ботанический сад"),
        Places(
            x = 9456473.43884585,
            y = 7652289.20850136,
            id = 10,
            name = "Памятник сотрудникам ТГУ, погибшим в ВОВ"
        ),
        Places(
            x = 9456447.84420623,
            y = 7652381.61922598,
            id = 11,
            name = "Памятник Менделееву и Флоринскому"
        ),
        Places(x = 9456407.70476394, y = 7652346.305709, id = 12, name = "Каменные бабы"),
        Places(x = 9456564.35583168, y = 7652340.17754987, id = 13, name = "Памятник Потанину"),
        Places(
            x = 9456559.56820736,
            y = 7652437.34717306,
            id = 14,
            name = "Геофизический центр Евразии"
        ),
        Places(x = 9456578.2590927, y = 7652520.34542826, id = 15, name = "Университетская роща"),
        Places(x = 9456448.49532314, y = 7652571.32405202, id = 16, name = "Лавочка примирения"),
        Places(x = 9455812.50730851, y = 7652190.57386513, id = 17, name = "Университетское озеро"),
        Places(x = 9456373.4828253, y = 7652456.34446636, id = 18, name = "Главный корпус ТГУ")
    )
}
